// JS - мова програмування з динамічною типізацією, високорівнева, інтерпретована, мультипарадигмова, скриптова

// JS виконується браузером (движком)

// стандарт ECMAScript

// функція для виведення повідомлелння через модальне вікно на сторінці браузера
// alert("Hello world!");

// функція для виведення даних в консоль (в інструментах розробника) 
// console.log("Hi!");

// // - це однорядковий коментар
// /* */ - це багаторядковий коментар




        // Змінні


    // - let це змінна , значення якої можна змінювати (не строге)
    // - перше присвоєння називається ініціалізація
    // - назви змінних, функцій, тощо пишемо в lowerCamelCase (перша буква маленька, далі кожне наступне слово з великої, без пробілів)
    // - класи,тощо пишемо в UpperCamelCase (перша буква велика, далі кожне наступне слово з великої, без пробілів)
    // - константи пишемо в UPPER_SNAKE_CASE (всі будки великі, слова розділені нижнім підчеркуванням)
    // можна використ наст символи: a-z, A-Z, _, $, 0-9 - для першої літери неможна використ цифри

let userName = 'Anrietta';
console.log(userName);  // - виведе лише значення Anrietta
// console.log('userName :>> ', userName); - виведе назву змінної + значення
userName = 1;
console.log(userName);

    // - const це змінна , значення якої НЕ можна змінювати (строге)
    // для уникнення випадкової зміни значення, всі змінні які не мають змінюватись, рекомендується оголошувати як const


// const constValue = 10;
// constValue = 5;  // Не дозволяє змінювати значення
// console.log(userName);


    // - var це змінна , значення якої можна змінювати (Вони устарівші , їх не використовувати!)
var anotherValue = 'string';